In [18]:
import logging
logging.basicConfig(filename="16FebInfo.log", level=logging.INFO, format="%(asctime)s %(name)s %(message)s")

In [19]:
# answer 1
"""Database:
 A database is a software system that allows the storage, organization, and retrieval of data. 
    It is essentially a collection of data that is stored and managed in a structured manner, 
    which can be easily accessed, managed, and updated.
"""
"""
    SQL (Structured Query Language) databases are based on the relational model, where data is stored
    in tables with predefined columns and relationships between them.
    SQL databases use SQL as the standard language for interacting with the data, for powerful querying, sorting, 
    filtering, and manipulating of data. 
    
Example: SQL databases are ideal for applications that require structured data, 
    such as financial transactions, online banking, e-commerce, and inventory management.
    
    NoSQL (Not Only SQL) databases, are used to handle unstructured, semi-structured,
    and complex data that does not fit neatly into tables. NoSQL databases use various data models, 
    such as document, key-value, graph, and column-family, to store and organize data.
    
Example: NoSQL databases are suitable for applications that require high availability, scalability, and agility,
    such as social media, gaming, IoT, and real-time analytics.
"""

'\n    SQL (Structured Query Language) databases are based on the relational model, where data is stored\n    in tables with predefined columns and relationships between them.\n    SQL databases use SQL as the standard language for interacting with the data, for powerful querying, sorting, \n    filtering, and manipulating of data. \n    \nExample: SQL databases are ideal for applications that require structured data, \n    such as financial transactions, online banking, e-commerce, and inventory management.\n    \n    NoSQL (Not Only SQL) databases, are used to handle unstructured, semi-structured,\n    and complex data that does not fit neatly into tables. NoSQL databases use various data models, \n    such as document, key-value, graph, and column-family, to store and organize data.\n    \nExample: NoSQL databases are suitable for applications that require high availability, scalability, and agility,\n    such as social media, gaming, IoT, and real-time analytics.\n'

In [20]:
# answer 2
"""
DDL stands for Data Definition Language, which is a set of SQL statements used to define and manipulate 
the structure of database objects such as tables, views, indexes, and constraints. 
DDL commands: CREATE, DROP, ALTER, and TRUNCATE
"""
"""
CREATE: CREATE statement is used to create a new database object such as a table, view, index, or constraint.
Syntax: CREATE object_type object_name (column_name1 data_type, column_name2 data_type, ...);

Example: CREATE TABLE employees (id INT PRIMARY KEY, name VARCHAR(50), salary INT);

DROP: DROP statement is used to remove a database object such as a table, view, index, or constraint.
Syntax: DROP object_type object_name;

Example: DROP TABLE employees;

ALTER: ALTER statement is used to modify the structure of an existing database object. 
Example: ALTER TABLE employees ADD COLUMN age INT;

TRUNCATE: TRUNCATE statement is used to remove all the data from a table, but it leaves the table structure intact.
Syntax: TRUNCATE TABLE table_name;

Example: TRUNCATE TABLE employees;
"""

'\nCREATE: CREATE statement is used to create a new database object such as a table, view, index, or constraint.\nSyntax: CREATE object_type object_name (column_name1 data_type, column_name2 data_type, ...);\n\nExample: CREATE TABLE employees (id INT PRIMARY KEY, name VARCHAR(50), salary INT);\n\nDROP: DROP statement is used to remove a database object such as a table, view, index, or constraint.\nSyntax: DROP object_type object_name;\n\nExample: DROP TABLE employees;\n\nALTER: ALTER statement is used to modify the structure of an existing database object. \nExample: ALTER TABLE employees ADD COLUMN age INT;\n\nTRUNCATE: TRUNCATE statement is used to remove all the data from a table, but it leaves the table structure intact.\nSyntax: TRUNCATE TABLE table_name;\n\nExample: TRUNCATE TABLE employees;\n'

In [22]:
# answer 3
"""
DML stands for Data Manipulation Language, which is a set of SQL statements used to manipulate the data
in a database. 
DML commands: INSERT, UPDATE, and DELETE.
"""
"""
INSERT: INSERT statement is used to add new data to a table.
Syntax: INSERT INTO table_name (column1, column2, ...) VALUES (value1, value2, ...);

Example: INSERT INTO employees (id, name, salary) VALUES (101, 'John Doe', 50000);

UPDATE: UPDATE statement is used to modify existing data in a table.
Syntax :UPDATE table_name SET column1 = value1, column2 = value2, ... WHERE condition;

Example: UPDATE employees SET salary = 55000 WHERE id = 101;

DELETE: DELETE statement is used to remove data from a table.
Syntax: DELETE FROM table_name WHERE condition;

Example: DELETE FROM employees WHERE id = 101;
"""

"\nINSERT: INSERT statement is used to add new data to a table.\nSyntax: INSERT INTO table_name (column1, column2, ...) VALUES (value1, value2, ...);\n\nExample: INSERT INTO employees (id, name, salary) VALUES (101, 'John Doe', 50000);\n\nUPDATE: UPDATE statement is used to modify existing data in a table.\nSyntax :UPDATE table_name SET column1 = value1, column2 = value2, ... WHERE condition;\n\nExample: UPDATE employees SET salary = 55000 WHERE id = 101;\n\nDELETE: DELETE statement is used to remove data from a table.\nSyntax: DELETE FROM table_name WHERE condition;\n\nExample: DELETE FROM employees WHERE id = 101;\n"

In [15]:
# answer 4
"""
DQL stands for Data Query Language, which is a set of SQL statements used to retrieve data from a database.
The primary command in DQL is SELECT.
"""
"""
SELECT: SELECT statement is used to retrieve data from one or more tables in a database. 
Syntax: SELECT column1, column2, ... FROM table_name WHERE condition ORDER BY column_name;

Example: SELECT name, salary FROM employees WHERE salary >= 50000 ORDER BY salary DESC;
"""

'\nSELECT: SELECT statement is used to retrieve data from one or more tables in a database. \nSyntax: SELECT column1, column2, ... FROM table_name WHERE condition ORDER BY column_name;\n\nExample: SELECT name, salary FROM employees WHERE salary >= 50000 ORDER BY salary DESC;\n'

In [23]:
# answer 5
# Primary Key and Foreign Key are used to establish relationships between tables.
"""
Primary Key:
          A primary key is a unique identifier for each record in a table. It is a column or a 
combination of columns that uniquely identifies each row in a table. The primary key is always unique, 
not null and cannot be duplicated.
"""
# CREATE TABLE students (student_id INT PRIMARY KEY, name VARCHAR(50), age INT, class VARCHAR(50));

"""
Foreign Key: 
          A foreign key is a column or a combination of columns in one table that refers to the
primary key of another table. A foreign key establishes a link between two tables by creating a relationship 
between them. It helps to maintain referential integrity between the related tables.
"""
# CREATE TABLE students (student_id INT PRIMARY KEY, name VARCHAR(50), class_id INT, FOREIGN KEY (class_id) REFERENCES classes(class_id));

'\nForeign Key: \n          A foreign key is a column or a combination of columns in one table that refers to the\nprimary key of another table. A foreign key establishes a link between two tables by creating a relationship \nbetween them. It helps to maintain referential integrity between the related tables.\n'

In [27]:
# answer 6
# to connect MySQL to Python, you can use the mysql-connector-python package

import mysql.connector

# connect to the database
mydb = mysql.connector.connect(
  host="localhost",
  user="abc",
  password="password",
)

logging.info("create a cursor object")
mycursor = mydb.cursor()

# execute a query  select all from table->test_table of database->db1
mycursor.execute("SELECT * FROM db1.test_table")
# mydb.commit() if modify/commit in db

logging.info("fetching the results")
res = mycursor.fetchall()

logging.info("printing the results")
for i in res:
  print(i)

mydb.close()

"""
cursor(): The cursor() method is used to create a cursor object. The cursor is an object that allows us 
to execute SQL statements and fetch the results. The cursor() method is called on the database connection 
object, and it returns a new cursor object.
"""
"""
execute(): The execute() method is used to execute an SQL statement. The SQL statement is passed as a 
string argument to the execute() method. The execute() method can be used to execute any SQL statement, 
such as SELECT, INSERT, UPDATE, DELETE, etc. Once the SQL statement is executed, the cursor object is 
ready to fetch the results using the fetchone(), fetchmany(), or fetchall() methods.
"""

'\nexecute(): The execute() method is used to execute an SQL statement. The SQL statement is passed as a \nstring argument to the execute() method. The execute() method can be used to execute any SQL statement, \nsuch as SELECT, INSERT, UPDATE, DELETE, etc. Once the SQL statement is executed, the cursor object is \nready to fetch the results using the fetchone(), fetchmany(), or fetchall() methods.\n'

In [26]:
# answer 7
# The order of execution of SQL clauses in an SQL query is as follows:
"""
FROM:
    The FROM clause is executed first, which specifies the table or tables from which the data is retrieved.

WHERE: 
    The WHERE clause is executed second, which filters the data based on a specified condition.

GROUP BY: 
    The GROUP BY clause is executed third, which groups the data based on a specified column or set of columns.

HAVING: 
    The HAVING clause is executed fourth, which filters the grouped data based on a specified condition.

SELECT: 
    The SELECT clause is executed fifth, which selects the columns to be displayed in the result set.

DISTINCT: 
    The DISTINCT clause is executed sixth, which eliminates duplicate values from the result set.

ORDER BY:
    The ORDER BY clause is executed seventh, which sorts the result set based on a specified column or set of columns.

LIMIT/OFFSET:
    The LIMIT and OFFSET clauses are executed last, which limits the number of rows returned or skips a specified number of rows in the result set.
"""

'\nFROM:\n    The FROM clause is executed first, which specifies the table or tables from which the data is retrieved.\n\nWHERE: \n    The WHERE clause is executed second, which filters the data based on a specified condition.\n\nGROUP BY: \n    The GROUP BY clause is executed third, which groups the data based on a specified column or set of columns.\n\nHAVING: \n    The HAVING clause is executed fourth, which filters the grouped data based on a specified condition.\n\nSELECT: \n    The SELECT clause is executed fifth, which selects the columns to be displayed in the result set.\n\nDISTINCT: \n    The DISTINCT clause is executed sixth, which eliminates duplicate values from the result set.\n\nORDER BY:\n    The ORDER BY clause is executed seventh, which sorts the result set based on a specified column or set of columns.\n\nLIMIT/OFFSET:\n    The LIMIT and OFFSET clauses are executed last, which limits the number of rows returned or skips a specified number of rows in the result set.\n'